#### 데이터프레임 결합
- 유니언 결합
    - 단순 행, 열 결합 방식
    - pandas에 내장된 concat() 함수 이용
        - concat([데이터프레임, 데이터프레임, ....])
            - axis=
                - 0(rows) : 행 결합
                - 1(columns) : 열 결합
            - ignore_index
                - False(기본값) : 결합 인덱스 보존
                - True : 결합 인덱스 초기화
- 조인 결합
    - 특정한 조건에 맞게 열을 결합하는 방식
    - 데이터 프레임 + 데이터 프레임 조인 결합 -> 특정 컬럼의 데이터들이 같은 값들로 이루어져 있을 때만 열 추가 결합
    - pandas에 내장된 merge() 함수 이용
        - merge(데이터프레임, 데이터프레임)
            - on
                - 조건식(두 개의 데이터프레임이 공통적으로 가지고 있는 컬럼명)
                - 두 데이터프레임의 칼럼명이 다른 경우
                    - 데이터프레임의 컬럼의 이름을 변경하고 merge() 사용
                    - left_on, right_on 매개변수를 이용하여 컬럼명 지정
            - how
                - left : 왼쪽 데이터프레임 기준 열집합
                - right : 오른쪽 데이터프레임 기준 열집합
                - inner : 교집합 기준 집합
                - outer : 합집합

In [1]:
import pandas as pd

In [2]:
data = {
    'name' : ['test', 'test2', 'test3'],
    'age' : [20,30,40]
}
df=pd.DataFrame(data)
df

    name  age
0   test   20
1  test2   30
2  test3   40

In [3]:
data2 = {
    'name': ['test4', 'test5'],
    'loc' : ['Seoul', 'Busan']
}
df2 = pd.DataFrame(data2)
df2

    name    loc
0  test4  Seoul
1  test5  Busan

In [4]:
# 단순 행 결합
pd.concat([df,df2], axis=0, ignore_index=True)

    name   age    loc
0   test  20.0    NaN
1  test2  30.0    NaN
2  test3  40.0    NaN
3  test4   NaN  Seoul
4  test5   NaN  Busan

In [5]:
# 단순 열 결합
pd.concat([df,df2], axis=1, ignore_index=True)

       0   1      2      3
0   test  20  test4  Seoul
1  test2  30  test5  Busan
2  test3  40    NaN    NaN

In [6]:
data = {
    'name' : ['test', 'test2', 'test3'],
    'loc' : ['서울', '경기', '강원']
}
df3 = pd.DataFrame(data)
df3

    name loc
0   test  서울
1  test2  경기
2  test3  강원

In [7]:
data2 = {
    'location' :['서울', '경기', '강원', '세종'],
    'code' : ['11', '31', '32', '29']
}
df4 = pd.DataFrame(data2)
df4

  location code
0       서울   11
1       경기   31
2       강원   32
3       세종   29

In [8]:
# df3, df4 조인 결합
## 두 개의 데이터프레임의 같은 데이터를 가진 컬럼의 이름이 다른 경우
## left_on, right_on을 이용하여 컬럼 지정
pd.merge(df3, df4, how='left', left_on='loc', right_on='location')

    name loc location code
0   test  서울       서울   11
1  test2  경기       경기   31
2  test3  강원       강원   32

In [9]:
# 데이터 프레임의 컬럼의 이름을 변경 후 조인 결합
df4.rename(
    columns={
        'location' : 'loc'
    },
    inplace=True
)

In [10]:
pd.merge(df3, df4, how ='left', on='loc')

    name loc code
0   test  서울   11
1  test2  경기   31
2  test3  강원   32

#### 데이터프레임의 결합 예제
1. tran_1, tran_2, tran_d_1, tran_d_2 4개의 파일 로드
2. tran_1, tran_2 단순 행 결합
3. tran_d_1, tran_d_2 단순 행 결합
4. 위 두 데이터프레임 조인결합

In [11]:
tran1=pd.read_csv('../../../../바탕 화면/Data/csv/tran_1.csv')
tran2=pd.read_csv('../../../../바탕 화면/Data/csv/tran_2.csv')
trand1=pd.read_csv('../../../../바탕 화면/Data/csv/tran_d_1.csv')
trand2=pd.read_csv('../../../../바탕 화면/Data/csv/tran_d_2.csv')

In [12]:

concat1 = pd.concat([tran1,tran2], axis=0, ignore_index=True)
concat1

     transaction_id   price         payment_date customer_id
0       T0000000113  210000  2019-02-01 01:36:57    PL563502
1       T0000000114   50000  2019-02-01 01:37:23    HD678019
2       T0000000115  120000  2019-02-01 02:34:19    HD298120
3       T0000000116  210000  2019-02-01 02:47:23    IK452215
4       T0000000117  170000  2019-02-01 04:33:46    PL542865
...             ...     ...                  ...         ...
6781    T0000006894  180000  2019-07-31 21:20:44    HI400734
6782    T0000006895   85000  2019-07-31 21:52:48    AS339451
6783    T0000006896  100000  2019-07-31 23:35:25    OA027325
6784    T0000006897   85000  2019-07-31 23:39:35    TS624738
6785    T0000006898   85000  2019-07-31 23:41:38    AS834214

[6786 rows x 4 columns]

In [13]:
concat2=pd.concat([trand1,trand2], axis=0, ignore_index=True)
concat2

      detail_id transaction_id item_id  quantity
0             0    T0000000113    S005         1
1             1    T0000000114    S001         1
2             2    T0000000115    S003         1
3             3    T0000000116    S005         1
4             4    T0000000117    S002         2
...         ...            ...     ...       ...
7139       7139    T0000006894    S004         1
7140       7140    T0000006895    S002         1
7141       7141    T0000006896    S001         2
7142       7142    T0000006897    S002         1
7143       7143    T0000006898    S002         1

[7144 rows x 4 columns]

In [18]:
df5=pd.merge(concat1, concat2, how ='left', on='transaction_id')
df5

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2
...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1

In [21]:
df5['transaction_id'].describe()

count            7144
unique           6786
top       T0000000790
freq                4
Name: transaction_id, dtype: object

In [23]:
# item_master.csv파일 로드
item_master = pd.read_csv('../../../../바탕 화면/Data/csv/item_master.csv')
item_master

  item_id item_name  item_price
0    S001      PC-A       50000
1    S002      PC-B       85000
2    S003      PC-C      120000
3    S004      PC-D      180000
4    S005      PC-E      210000

In [24]:
# df5, item_master 조인 결합
df5 = pd.merge(df5,item_master, how='left', on='item_id')

In [25]:
df5

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,item_name,item_price
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,PC-E,210000
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1,PC-A,50000
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1,PC-C,120000
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1,PC-E,210000
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2,PC-B,85000
...,...,...,...,...,...,...,...,...,...
7139,T0000006894,180000,2019-07-31 21:20:44,HI400734,7139,S004,1,PC-D,180000
7140,T0000006895,85000,2019-07-31 21:52:48,AS339451,7140,S002,1,PC-B,85000
7141,T0000006896,100000,2019-07-31 23:35:25,OA027325,7141,S001,2,PC-A,50000
7142,T0000006897,85000,2019-07-31 23:39:35,TS624738,7142,S002,1,PC-B,85000
7143,T0000006898,85000,2019-07-31 23:41:38,AS834214,7143,S002,1,PC-B,85000

In [27]:
df5['payment_date']=pd.to_datetime(df5['payment_date'])

In [29]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7144 entries, 0 to 7143
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  7144 non-null   object
 1   price           7144 non-null   int64
 2   payment_date    7144 non-null   datetime64[ns]
 3   customer_id     7144 non-null   object
 4   detail_id       7144 non-null   int64
 5   item_id         7144 non-null   object
 6   quantity        7144 non-null   int64
 7   item_name       7144 non-null   object
 8   item_price      7144 non-null   int64
dtypes: datetime64[ns](1), int64(4), object(4)
memory usage: 502.4+ KB

In [34]:
## 시계열 데이터에서 요일을 추출하여 파생변수에 담기
## case 1 (map함수 + lambda)
df5['payment_date'].map(
    lambda x: x.strftime('%a')
)

0       Fri
1       Fri
2       Fri
3       Fri
4       Fri
       ...
7139    Wed
7140    Wed
7141    Wed
7142    Wed
7143    Wed
Name: payment_date, Length: 7144, dtype: object

In [38]:
# case 2 (Series에서 시계열 데이터 함수 사용)
df5['week']=df5['payment_date'].dt.strftime('%w')

In [39]:
## 요일별 price의 합계, 거래 개수 확인

df5['price2']=df5['quantity']*df5['item_price']

df5.head()

,transaction_id,price,payment_date,customer_id,detail_id,item_id,quantity,item_name,item_price,price2,week
0,T0000000113,210000,2019-02-01 01:36:57,PL563502,0,S005,1,PC-E,210000,210000,5
1,T0000000114,50000,2019-02-01 01:37:23,HD678019,1,S001,1,PC-A,50000,50000,5
2,T0000000115,120000,2019-02-01 02:34:19,HD298120,2,S003,1,PC-C,120000,120000,5
3,T0000000116,210000,2019-02-01 02:47:23,IK452215,3,S005,1,PC-E,210000,210000,5
4,T0000000117,170000,2019-02-01 04:33:46,PL542865,4,S002,2,PC-B,85000,170000,5

In [43]:
df5[['week', 'price2']].groupby(
['week']
).agg(['sum','count'])

         price2
            sum count
week
0     140785000  1051
1     131370000   988
2     137995000  1012
3     139070000  1022
4     136720000   992
5     144570000  1063
6     140625000  1016

In [45]:
df5.pivot_table(
    index='week',
    values='price2',
    aggfunc=['sum','count']
)

            sum  count
         price2 price2
week
0     140785000   1051
1     131370000    988
2     137995000   1012
3     139070000   1022
4     136720000    992
5     144570000   1063
6     140625000   1016